<script lang="ts">
	import { onMount } from 'svelte';
	import { scrollToTarget } from '$lib/actions/scroll';

	function handleLinkClick(event: MouseEvent) {
		event.preventDefault();
		const targetLink = event.currentTarget as HTMLAnchorElement;
		const id = targetLink.getAttribute('href');
		if (id) {
			scrollToTarget(id);
		}
	}

	onMount(() => {
		setTimeout(() => {
			const hash = window.location.hash;
			if (hash) {
				scrollToTarget(hash);
			}
		}, 100);
	});
</script>

<svelte:head>
	<title>Lestix - Важное</title>
	<meta property="og:title" content="Lestix - Важное" />
	<meta
		property="og:description"
		content="Решение проблемы двухнедельной фазы и сохранение интереса к игре."
	/>
	<meta property="og:url" content="https://levionid.github.io/important" />
	<meta property="og:image" content="https://levionid.github.io/meta-image.png" />
</svelte:head>

<header class="hero hero-small">
	<div class="hero-content">
		<h1>Важная информация</h1>
	</div>
</header>

<div class="main-content main-content-small-hero">
	<div class="intro-block">
		<span class="tag">Проблема</span>
		<h1>Двухнедельная фаза</h1>
		<p>
			Все мы знаем об эффекте <b>двухнедельной фазы</b>, когда мы спидраним майн, строим дом и
			больше <b>не видим смысла</b> в игре. Этот документ направлен на <b>решение</b> этой проблемы
			и определение <b>цели</b> самого сервера.
		</p>
	</div>
	<main>
		<div class="text-block">
			<h2>Причины этой проблемы:</h2>
			<div class="blocks">
				<a href="#speedrun" class="block" on:click={handleLinkClick}>
					<h3>Спидран</h3>
					<p>
						Наш сервер - это не гонка за тем, у кого больше ресов. Давайте играть вместе, чтобы
						весело проводить время, а не гриндить.
					</p>
				</a>
				<a href="#isolation" class="block" on:click={handleLinkClick}>
					<h3>Изоляция</h3>
					<p>
						Уходя за тысячи блоков, ты создаёшь себе одиночный мир на многопользовательском сервере.
						Играть вместе - интереснее.
					</p>
				</a>
				<a href="#ignoring" class="block" on:click={handleLinkClick}>
					<h3>Игнорирование других</h3>
					<p>
						Не обращая внимания на людей, ты упускаешь самое главное. Общаясь, торгуя и создавая
						проекты, играть веселее.
					</p>
				</a>
				<a href="#griefing" class="block" on:click={handleLinkClick}>
					<h3>Гриферство</h3>
					<p>Хочешь взорвать дом, украсть вещи и покинуть сервер на первой неделе? Оригинально)</p>
				</a>
				<a href="#novelty" class="block" on:click={handleLinkClick}>
					<h3>Отсутствие новизны</h3>
					<p>
						Игра быстро превращается в рутину, когда нет новых испытаний. Без ивентов и общих целей
						становится скучно.
					</p>
				</a>
				<a href="#project" class="block" on:click={handleLinkClick}>
					<h3>Отсутствие общего проекта</h3>
					<p>
						Ты выживаешь не один. Вместе мы можем сделать что-то грандиозное. Воспоминания и общение
						- вот что нам нужно.
					</p>
				</a>
			</div>
		</div>

		<div class="text-block" id="speedrun">
			<h2>1. Спидран</h2>
			<h3>Почему это проблема</h3>
			<p>
				Когда игроки воспринимают сервер как гонку на прохождение, основной геймплей сводится к
				максимально быстрой добыче лучших ресурсов и убийству дракона. После достижения этих целей
				игра теряет смысл, и наступает выгорание. Такой подход обесценивает процесс, творчество и,
				самое главное, взаимодействие с другими, превращая совместную игру в одиночное соревнование.
			</p>
			<h3>Решение</h3>
			<p>
				Мы смещаем акцент с личного прогресса на коллективные достижения. Вместо того чтобы хвастаться
				незеритовой броней на третий день, давайте вместе отправимся в поход за элитрами. Давайте
				организовывать совместные походы на боссов, где важна не скорость, а тактика и слаженная работа
				команды. Ценность сервера - в общем пути, а не в том, кто первым добежит до финиша.
			</p>
		</div>

		<div class="text-block" id="isolation">
			<h2>2. Изоляция</h2>
			<h3>Почему это проблема</h3>
			<p>
				Строительство базы вдали от всех - это естественное желание обезопасить себя, но на сервере,
				ориентированном на сообщество, это приводит к разобщению. Игроки не видят построек друг друга,
				не могут быстро прийти на помощь или зайти в гости. Сервер превращается в набор одиночных
				миров, которые просто запущены на одном ядре.
			</p>
			<h3>Решение</h3>
			<p>
				Мы призываем всех строиться в пределах общей, заранее оговоренной территории. Основание общего
				города или поселения со стартовой инфраструктурой (например, центральная площадь, склад, портал
				в Незер) поможет укрепить связи. Создание общей сети дорог или веток метро в Незере не только
				упростит логистику, но и будет постоянно напоминать о том, что вы играете не одни.
			</p>
		</div>

		<div class="text-block" id="ignoring">
			<h2>3. Игнорирование других</h2>
			<h3>Почему это проблема</h3>
			<p>
				Молчаливая игра на многопользовательском сервере лишает смысла само его существование. Без
				общения, торговли и взаимопомощи теряются уникальные возможности, которые дает совместная игра.
				Сервер становится пустым и безжизненным, а игроки упускают шанс найти друзей и реализовать
				масштабные идеи.
			</p>
			<h3>Решение</h3>
			<p>
				Мы будем активно поощрять взаимодействие. Создание торгового района или рынка, где игроки смогут
				обмениваться ресурсами, станет центром экономической жизни сервера. Регулярные общие сборы в
				голосовом чате (даже просто для общения), а также доска объявлений в игре или в Discord для
				поиска помощи или напарников для проектов помогут наладить коммуникацию.
			</p>
		</div>

		<div class="text-block" id="griefing">
			<h2>4. Гриферство</h2>
			<h3>Почему это проблема</h3>
			<p>
				Гриферство и воровство - это самый быстрый способ убить сервер. Они уничтожают доверие между
				игроками и обесценивают часы, потраченные на строительство и сбор ресурсов. Никому не
				захочется вкладывать душу в проект, если его в любой момент могут разрушить. Это создает
				токсичную атмосферу страха и паранойи.
			</p>
			<h3>Решение</h3>
			<p>
				На сервере действуют строгие правила, запрещающие гриферство, воровство и убийство без
				обоюдного согласия. Для защиты построек будут использоваться плагины на приват территорий. Любое
				нарушение будет немедленно расследоваться, а виновные - наказываться вплоть до перманентного
				бана. Мы строим сообщество, основанное на взаимном уважении.
			</p>
		</div>

		<div class="text-block" id="novelty">
			<h2>5. Отсутствие новизны</h2>
			<h3>Почему это проблема</h3>
			<p>
				Стандартный цикл развития в Minecraft хорошо знаком большинству игроков. После постройки дома и
				добычи алмазов игра может превратиться в монотонный гринд без четкой цели. Это однообразие -
				прямой путь к потере интереса и уходу с сервера.
			</p>
			<h3>Решение</h3>
			<p>
				Мы будем регулярно вносить в игру разнообразие с помощью ивентов. Это могут быть строительные
				конкурсы с призами, квесты с поиском сокровищ по всему миру, PvP-турниры на специально
				построенных аренах или даже сюжетные события, развивающие историю сервера. Это создаст
				постоянный поток новых целей и впечатлений.
			</p>
		</div>

		<div class="text-block" id="project">
			<h2>6. Отсутствие общего проекта</h2>
			<h3>Почему это проблема</h3>
			<p>
				Индивидуальные базы - это прекрасно, но ничто так не объединяет игроков, как работа над одной
				общей, амбициозной целью. Без такого проекта энергия сообщества распыляется. Общий проект дает
				всем игрокам повод для взаимодействия, кооперации и создает чувство гордости за коллективное
				достижение.
			</p>
			<h3>Решение</h3>
			<p>
				С самого начала сезона мы определим и запустим большой общий проект. Это может быть строительство
				столицы сервера, осушение океанического монумента и его перестройка, создание гигантской
				карты-арта, постройка функционального парка развлечений или создание сложной сети железных
				дорог. Такой проект станет сердцем сервера и главным источником совместных воспоминаний.
			</p>
		</div>
	</main>
</div>

<style>
	a {
		text-decoration: none;
		color: unset;
	}
	.blocks .block h3 {
		font-size: 20px;
		font-weight: 600;
		margin-top: 0;
	}
	.text-block h3 {
		font-size: 18px;
		font-weight: 600;
		color: var(--primary-text-color);
		margin-top: 1em;
	}
</style>